app/controllers/completions_controller.rb

SELECT `completions`.* FROM `completions`
---
  def index
    render json: Completion.all