app/controllers/tools_controller.rb

  def index
    @tools = Tool.all
---
SELECT `tools`.* FROM `tools`

  def show
    @tool = Tool.find(params[:id])
---
SELECT  `tools`.* FROM `tools` WHERE `tools`.`id` = 1 LIMIT 1